import React from "react";
import { Link } from "react-router-dom";
import styles from "./CountryHouse.module.css";
import Title from "../HeaderForBackNInfoLinks/Title";
import Aside from "./Aside";
import countryhouse1 from "../utils/img/countryhouse1.png";
import countryhouse2 from "../utils/img/countryhouse2.png";

export default function CountryHouse({ setLink, link }) {
  const href = window.location.href;
  setLink(href);

  return (
    <>
      <Title link={link} />
      <main className={styles.country_house}>
        <div className={styles.text_block}>
          <p>
            Якщо є ділянка за містом, і Ви мрієте про дачу – ми готові Вам
            допомогти. Нами <br />
            здійснюється будівництво дачних будинків під ключ у короткий термін.
            У нас можна <br /> замовити будівництво дач: <br />
            <br />
          </p>
          <div className={styles.list_block}>
            <div className={styles.list}>
              <p className={styles.number_list}>1.</p>
              <span className={styles.list_text}>
                З клеєного профільованого бруса - якщо Ви хочете приїжджати на
                ділянку не лише влітку, а й у холодну пору року. Такий будинок
                швидко будується і буде теплим, затишним, екологічно чистим.
              </span>
            </div>
            <div className={styles.list}>
              <p className={styles.number_list}>2.</p>
              <span className={styles.list_text}>
                За каркасною технологією з обшивкою дерев'яного каркаса як
                зовні, так і всередині: дерев'яним фальш-брусом або вагонкою,
                сайдингом, вологостійким гіпсокартоном або аквапанелі. Стіни
                утеплюються мінеральною ватою або пінополістеролом (СІП-панель).
                Ця технологія дає змогу не затягувати будівництво на довгий час.
                Цей варіант підходить, якщо приїжджати на дачу Ви будете лише в
                теплу пору року. Перевага каркасної споруди в тому, що вона не
                вимагає влаштування дорогих залізобетонних фундаментів.
                Найшвидшою є споруда, що складається з декількох модулів, які
                збираються на виконаних фундаментах протягом декількох днів.
              </span>
            </div>
            <div className={styles.list}>
              <p className={styles.number_list}>3.</p>
              <span className={styles.list_text}>
                З класичних матеріалів: цегла, керамоблок, газобетон, пінобетон.
              </span>
            </div>
          </div>
          <p>
            Оскільки сама конструкція каркасного будинку або будинку з клеєного
            бруса має невелику вагу, порівняно з цегляними або газобетонними
            будовами, то й навантаження на ґрунт вона даватиме невелику. Це
            дозволить будувати будівлі навіть на просадних ґрунтах. Тому
            фундамент у вигляді гвинтових паль або монолітних паль-колон -
            ідеальне рішення під будівництво каркасної дачі, який швидко та
            легко монтується нашими спеціалістами.
          </p>
          <h2>Чому будівництво дач вигідно замовляти саме у нас?</h2>
          <p>
            Наша компанія пропонує низку вигідних для Вас умов, завдяки яким
            будівництво будинку на дачі буде легким та необтяжливим для Вас
            процесом.
          </p>
          <ul>
            <li>
              1. Індивідуальна розробка або вибір готового проекту - просто
              обравши сподобався варіант із каталогу. Це дозволить заощадити час
              і негайно приступити до будівництву. Якщо запас часу є, то можна
              замовити індивідуальну розробку дачного будиночка (орієнтовний
              термін розробки проекту від 2-х робочих днів), щоб отримати
              будиночок своєї мрії. Наші конструктори обов'язково врахують усі
              побажання клієнта, постараються втілити в життя найшаленіші ідеї!
              <br />
              <br />
            </li>
            <li>
              2. Швидке будівництво дач. І каркасна, і дерев'яна дача зводиться
              за невелику проміжок часу у зв'язку з невеликими обсягами та
              принципово типовими рішеннями. Оздоблювальні роботи та монтаж
              комунікацій можна проводити, як тільки стіни і дах будуть готові.
              <br />
              <br />
            </li>
            <li>
              3. Низька вартість будівництва дачі. У компанії «BUDVEST» є
              варіанти недорогих будиночків. Якщо Ви хочете зробити капітальне
              будівництво, то наші фахівці виконують будівництво заміських дач
              із зазначеного Вами матеріалу згідно техзавдання, підписане
              замовником.
              <br />
              <br />
            </li>
            <li>
              4. Якісні будівельні матеріали. Вам не потрібно дбати про
              замовлення та своєчасну постачання необхідних інструментів та
              матеріалів на ділянку. Все це стає нашою турботою.
              <br />
              <br />
            </li>
          </ul>
          <button>ЗАМОВИТИ КОНСУЛЬТАЦІЮ</button>
          <h2 className={styles.examples_h2}>Приклади готових робіт:</h2>
          <div className={styles.img_blocks}>
            <div className={styles.img_block}>
              <img src={countryhouse1} alt="" />
              <div className={styles.img_text}>
                <h3>z39</h3>
                <p>
                  Проект будинку невеликого за своїм розміром та простого у
                  будівництві.
                  <br />
                  <br />
                  Термін розробки проекту: 3 дні
                  <br />
                  <br />
                  Орієнтовна ціна: <span className={styles.price}>13 500 грн</span>
                </p>
                <span className={styles.yellow_more}>Детальніше &#62;</span>
              </div>
            </div>
            <div className={styles.img_block}>
              <img src={countryhouse2} alt="" />
              <div className={styles.img_text}>
                <h3>z16</h3>
                <p>
                  Варіант будинку придатного як для дачного відпочинку, так і
                  цілорічного проживання.
                  <br />
                  <br />
                  Термін розробки проекту: 4 дні
                  <br />
                  <br />
                  Орієнтовна ціна: <span className={styles.price}>15 000 грн</span>
                </p>
                <span className={styles.yellow_more}>Детальніше &#62;</span>
              </div>
            </div>

            <Link to="/projects">Переглянути більше прикладів &#62;</Link>
          </div>
        </div>
        <Aside link={link}/>
      </main>
    </>
  );
}
