import React from "react";
import Title from "../HeaderForBackNInfoLinks/Title";
import Aside from "./Aside";
import styles from "./CountryHouse.module.css";
import service1 from "../utils/img/service1.png";
import service2 from "../utils/img/service2.png";
import { Link } from "react-router-dom";

function Visualisation({ setLink, link }) {
  const href = window.location.href;
  setLink(href);

  return (
    <>
      <Title link={link} />
      <section className={styles.visualization}>
        <div className={styles.container}>
          <h2>
            3D-візуалізація - використання комп'ютерних технологій у будівництві
          </h2>
          <p>
            Для зовнішнього та внутрішнього оформлення житла існує безліч ідей
            та рішень. Дуже важко уявити собі, як виглядатимуть меблі на
            загальному тлі, чи вдалим буде поєднання відтінків. Тим більше,
            дизайн інтер'єру будинку неможливо уявити за одними лише кресленнями
            і планів.
            <br />
            <br /> Сучасні комп'ютерні програми дають можливість створювати
            об'ємні комп'ютерні зображення різних варіантів інтер'єрів із
            підбором оздоблення, предметів меблів. Це зображення є
            3D-візуалізація дизайну. Ви, ніби, дивіться на відеозйомку вже
            готового реального інтер'єру, хоча насправді йому належить втілення
            в життя.
            <br />
            <br /> Наша компанія створює дизайн інтер'єру та екстер'єру будинку
            ще на етапі проектування. Це дозволяє, при необхідності, внести
            зміни не тільки в дизайн, але і, можливо, планування приміщень.
          </p>
          <h2>Можливості, які відкриває 3D-візуалізація</h2>
          <p>
            ЗД дизайн надає для замовників, архітекторів, дизайнерів та
            будівельників наступні можливості:
          </p>
          <ul className={styles.list_container}>
            <li>
              1. Побачити дизайн інтер'єру будинку заздалегідь. Оскільки
              створення проекту в 3D відбувається на стадії розробки проекту,
              можна побачити заздалегідь, як виглядає декоративне оздоблення, чи
              підходять колірні рішення та фактури матеріалів.
            </li>
            <li>
              2. Розробити і вибрати найбільш підходящий дизайн інтер'єру
              заміського будинку кількох варіантів.
            </li>
            <li>
              3. Продемонструвати замовнику, як виглядатиме приміщення у різних
              стилях та наочно показати, чим класичний дизайн відрізняється,
              наприклад, від оформлення у стилі лофт.
            </li>
            <li>
              4. Пропрацювати проект у деталях та усунути помилки до початку
              його реалізації.
            </li>
            <li>
              5. Розділити простір приміщення на зони з максимально ефективним
              використанням корисного простору.
            </li>
            <li>
              7. Детально опрацювати дизайн екстер'єру приватного будинку та
              вибрати оптимальне поєднання декоративних елементів.
            </li>
            <li>
              8. Швидше здійснювати роботи з оформлення будинку чи котеджу та
              гнучко реагувати на позапланові зміни.
            </li>
            <li>
              9. Ефективно контролювати проведення оздоблювальних робіт та
              закупівлю необхідних матеріалів шляхом звіряння з 3-д дизайном.
            </li>
          </ul>
          <p>
            Дизайнер нашої компанії, дотримуючись чіткої послідовності робіт,
            створить гарний інтер'єр, а також екстер'єр.
          </p>

          <div className={styles.list_block}>
            <div className={styles.list}>
              <p className={styles.number_list}>1.</p>
              <span className={styles.list_text}>
                На початковому етапі відбувається зустріч із замовником. Бажано,
                щоб він приніс із собою фото вподобаного будинку, а також
                внутрішнього оздоблення. Разом із клієнтом наш спеціаліст
                обговорює основні нюанси: стиль, розташування меблів та іншого
                декору. Наш спеціаліст з багаторічним досвідом роботи неодмінно
                вислухає побажання замовника – все для того, щоб проект
                передавав настрій, індивідуальність клієнта. Знаючи, яка буде
                ідея, маючи на руках схематичний план, візуалізатор розпочне
                роботу - створить точну модель кожного приміщення, а також
                розміщених там об'єктів.
              </span>
            </div>
            <div className={styles.list}>
              <p className={styles.number_list}>2.</p>
              <span className={styles.list_text}>
                Після створення моделі фахівець приступає до наступного етапу –
                здійснює оформлення. Тут візуалізатор приступає до
                промальовування матеріалу. Він створює його реалістичним,
                наскільки це можливо. Створюються детально всі елементи – від
                тих, якими буде оформлятися фасад, до найменших об'єктів
                інтер'єру. Звичайно, для оформлення вдома, створення
                внутрішнього наповнення потрібні різні матеріали і всі вони, без
                винятки, вимагають ретельного опрацювання.
              </span>
            </div>
            <div className={styles.list}>
              <p className={styles.number_list}>3.</p>
              <span className={styles.list_text}>
                Якщо залишити 3D-візуалізацію як є, вона виглядатиме неприродно.
                Тому візуалізатор приступає до наступного етапу – створення
                освітлення. Він підбирає найбільш підходящий варіант
                освітлювальних приладів, а також оптимальне їх місцезнаходження.
                У роботі враховується розташування віконних отворів, крізь які
                приміщення освітлюється сонячним світлом. Результатом виконаних
                робіт буде проект з тінями.
              </span>
            </div>
            <div className={styles.list}>
              <p className={styles.number_list}>4.</p>
              <span className={styles.list_text}>
                Якщо залишити 3D-візуалізацію як є, вона виглядатиме неприродно.
                Тому візуалізатор приступає до наступного етапу – створення
                освітлення. Він підбирає найбільш підходящий варіант
                освітлювальних приладів, а також оптимальне їх місцезнаходження.
                У роботі враховується розташування віконних отворів, крізь які
                приміщення освітлюється сонячним світлом. Результатом виконаних
                робіт буде проект з тінями.
              </span>
            </div>
          </div>
          <button>ЗАМОВИТИ КОНСУЛЬТАЦІЮ</button>
          <h2 className={styles.examples_h2}>Приклади готових робіт:</h2>
          <div className={styles.img_blocks}>
            <div className={styles.img_block}>
              <img src={service1} alt="" />
              <div className={styles.img_text}>
                <h3>RANKOVY TOWNHOUSE</h3>
                <p>
                  Каркасні котеджі для постійного сімейного проживання
                  <br />
                  <br />
                  Матеріал стін: Дерев'яний каркас <br />
                  <br />
                  Орієнтовна ціна:{" "}
                  <span className={styles.price}>65 000 грн</span>
                </p>
                <span className={styles.yellow_more}>Детальніше &#62;</span>
              </div>
            </div>
            <div className={styles.img_block}>
              <img src={service2} alt="" />
              <div className={styles.img_text}>
                <h3>BIRMINGHAM HOUSE</h3>
                <p>
                  Індивідуального двоповерховий каркасний будинок для постійного
                  сімейного проживання.
                  <br />
                  <br />
                  Матеріал стін: Дерев'яний каркас <br />
                  <br />
                  Орієнтовна ціна:{" "}
                  <span className={styles.price}>30 000 грн</span>
                </p>
                <span className={styles.yellow_more}>Детальніше &#62;</span>
              </div>
            </div>

            <Link to="/projects">Переглянути більше прикладів &#62;</Link>
          </div>
        </div>
        <Aside />
      </section>
    </>
  );
}

export default Visualisation;
